monads/if-not-error/ex1.org
#+TITLE: Fluent, Composable Error Handling
#+AUTHOR: Brian Beckman
#+LATEX_HEADER: \usepackage{tikz}
#+LATEX_HEADER: \usepackage{tikz}
#+LATEX_HEADER: \usepackage{tikz-cd}
#+LATEX_HEADER: \usetikzlibrary{matrix,arrows,positioning,scopes,chains}
#+LATEX_HEADER: \tikzset{node distance=2cm, auto}
#+BEGIN_COMMENT
The following line generates a benign error
#+LATEX_HEADER: \usepackage{amsmath, amsthm, amssymb}
#+END_COMMENT
#+STYLE: <link rel="stylesheet" type="text/css" href="styles/default.css" />
#+BEGIN_COMMENT
  TODO: Integrate BibTeX
#+END_COMMENT

* Introduction
  
  Consider a program composed of /serially dependent computations/,
  any of which produces either a value to send down the line, or an
  error. If any computation produces an error, no downstream
  computations should be attempted; the error should be the result of
  the entire sequence.

  We show a sequence of programs in Java and Clojure for this
  scenario. We strive for fluent style, which minimizes the number of
  temporary variables to name and manage. This style directly mimics
  the abstract data flow of the solution.

  We find that fluent style is only available in Java if errors are
  propagated by exception. Because tht code for handling errors is in
  an independent /catch/ block, the non-error code path can be written
  without explicitly handling errors. 

  With functional programming in general and Clojure in particular, we
  can have fluent code without exceptions because we can delegate
  error handling to a monad.

* Motivating Example Problem  

  As a concrete example, suppose we get an authorization token, do a
  database lookup, do a web-service call, filter the results of that
  call, do another web-servie call, and then combine the results. The
  data flow of our program resembles that in figure
  \ref{fig:dataflow}.

\begin{figure}
\begin{center}
\begin{tikzpicture}[
  font=\sffamily,
  every matrix/.style={ampersand replacement=\&,column sep=1cm,row sep=1cm},
  source/.style={draw,thick,rounded corners,fill=yellow!20,inner sep=.3cm},
  process/.style={draw,thick,circle,fill=blue!20},
  sink/.style={source,fill=green!20},
  rectangle/.style={draw,very thick,shape=rectangle,inner sep=.3cm},
  dots/.style={gray,scale=2},
  invisible/.style={},
  to/.style={->,>=stealth',shorten >=1pt,semithick,font=\sffamily\footnotesize},
  every node/.style={align=center}]

  % Position  nodes using a matrix layout
  \matrix{
      {}
      \& \node[source] (auth) {get authToken};
      \& \\

      {}
      \& \node[process] (database) {read\\database};
      \& \\

      \node[process] (wscall1) {call web\\svc 1};
      \& 
      \& \node[process] (wscall2) {call web\\svc 2}; \\

      \node[process] (filter) {filter};
      \&
      \& \node[invisible] (placeholder) {}; \\

      {}
      \& \node[process] (combine) {combine};
      \& \\

      {}
      \& \node[sink] (result) {result};
      \& \\
  };

  % Draw the arrows between the nodes and label them.
  \draw[to] (auth) -- node[midway,right] {auth\\token} (database);
  \draw[to] (database) -- node[midway,left] {PO} (wscall1);
  \draw[to] (database) -- node[midway,right] {PO} (wscall2);
  \draw[to] (wscall1)  -- node[midway,left] {item} (filter);
  \draw[to] (filter)   -- node[midway,left] {item} (combine);
  \draw[to] (wscall2)  -- node[midway,right] {price} (combine);
  \draw[to] (combine)  -- (result);

\end{tikzpicture}
\end{center}
\caption{\label{fig:dataflow}Serially dependent computations}
\end{figure}

** Fluent Solution in Java, No Error Handling

  In the \mbox{C++ -- like} languages, including JavaScript and Java,
  we might keep intermediate results in instance variables and model
  the flow in object-to-object methods, that is, as
  \textbf{transforms}. This style is called \textbf{fluent style}
  because the text of the program resembles the flow in the diagram.
  
  Imagine a /main/ program like the following, in which each transform
  is on its own line, indented from its /source/ by one
  \mbox{4-space} tab stop. The \textbf{source} of a transform is an
  expression that produces an object to feed downstream.
#+BEGIN_SRC java :tangle no
    public static void main(String[] args) {
        Computation databaseResults = new Computation()
            .authorize()
            .readDatabase();
        String result = databaseResults
            .callWebService()
            .filterResults()
            .combineResults(databaseResults
                .callOtherWebService());
        System.out.println(result); }
#+END_SRC

  The correspondence between the diagram of the program and the code
  is obvious. The code /looks like/ the diagram. Given a change to the
  diagrammatic specification, a programmer may propagate the change
  straightforwardly to the code due to fluent style.

  We save the /Computation/ produced by reading the database in its
  own local variable, namely /databaseResults/. The dataflow branches
  from that result; wd need it twice, once for calling the first web
  service and once for calling the second web service. If not for this
  branching and recombining of the dataflow, we might have written the
  entire program as one, fluent expression with no intermediate
  variables.

  Also note the non-idiomatic compressed style, minimizing blank lines
  and lines with just one closing brace. We adopt this style to save
  space in this paper; production versions of such code would have
  more white space.

*** A Complete Sample Program

  The following is a complete program that mocks out the database and
  web-service results as static JSON objects encoded in strings. This
  can be compiled and executed, even online in a sandbox like
  http://www.compileonline.com/compile_java_online.php.

  The most important thing to note about this code is that each
  method, /e.g./, /authorize/, /readDatabase/, etc., takes an object
  -- implicitly as /this/ -- and returns an object. This convention
  enables the fluent style by chaining transforms with dot. It so
  happens that we return /this/ from each method. We could create a
  new object in each transform, but it would not simplify the code and
  would not give any performance advantage (quite the opposite).
  Instead, we propagate values through instance variables, namely
  /authToken/, /databaseResults/, etc. 
#+BEGIN_SRC java :tangle no
public class Computation {
    private String authToken;
    private String databaseResults;
    private String webServiceCallResults;
    private String filteredWebServiceCallResults;
    private String otherWebServiceCallResults;
    
    public Computation () {}
    public Computation authorize() {
        authToken = "John's credentials";
        return this; }
    public Computation readDatabase() {
        databaseResults = "{\"name\":\"John\", \"PO\":\"421357\"}";
        return this; }
    public Computation callWebService() {
        webServiceCallResults =
            "[{\"item\":\"camera\"}, {\"item\":\"shoes\"}]";
        return this; }
    public Computation filterResults() {
        filteredWebServiceCallResults =
            "[{\"item\":\"camera\"}]";
        return this; }
    public Computation callOtherWebService() {
        otherWebServiceCallResults = "{\"price\":\"420.00\"}";
        return this; }
    public String combineResults(Computation other) {
        return "{[" + filteredWebServiceCallResults +
            "," + otherWebServiceCallResults + "]}"; }

    public static void main(String[] args) {
        Computation databaseResults = new Computation()
            .authorize()
            .readDatabase();
        String result = databaseResults
            .callWebService()
            .filterResults()
            .combineResults(databaseResults
                .callOtherWebService());
        System.out.println(result);
}   }
#+END_SRC

