monads/if-not-error/ex1.tex
% Created 2014-01-15 Wed 11:38
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage[normalem]{ulem}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{amstext}
\usepackage{hyperref}
\tolerance=1000
\usepackage{tikz}
\usepackage{tikz}
\usepackage{tikz-cd}
\usetikzlibrary{matrix,arrows,positioning,scopes,chains}
\tikzset{node distance=2cm, auto}
\author{Brian Beckman}
\date{\today}
\title{Fluent, Composable Error Handling}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 24.3.1 (Org mode 8.0)}}
\begin{document}

\maketitle
\tableofcontents


\section{Introduction}
\label{sec-1}

Consider a program composed of \emph{serially dependent computations},
any of which produces either a value to send down the line, or an
error. If any computation produces an error, no downstream
computations should be attempted; the error should be the result of
the entire sequence.

We show a sequence of programs in Java and Clojure for this
scenario. We strive for fluent style, which minimizes the number of
temporary variables to name and manage. This style directly mimics
the abstract data flow of the solution.

We find that fluent style is only available in Java if errors are
propagated by exception. Because tht code for handling errors is in
an independent \emph{catch} block, the non-error code path can be written
without explicitly handling errors.

With functional programming in general and Clojure in particular, we
can have fluent code without exceptions because we can delegate
error handling to a monad.
\section{Motivating Example Problem}
\label{sec-2}

As a concrete example, suppose we get an authorization token, do a
database lookup, do a web-service call, filter the results of that
call, do another web-servie call, and then combine the results. The
data flow of our program resembles that in figure
\ref{fig:dataflow}.

\begin{figure}
\begin{center}
\begin{tikzpicture}[
  font=\sffamily,
  every matrix/.style={ampersand replacement=\&,column sep=1cm,row sep=1cm},
  source/.style={draw,thick,rounded corners,fill=yellow!20,inner sep=.3cm},
  process/.style={draw,thick,circle,fill=blue!20},
  sink/.style={source,fill=green!20},
  rectangle/.style={draw,very thick,shape=rectangle,inner sep=.3cm},
  dots/.style={gray,scale=2},
  invisible/.style={},
  to/.style={->,>=stealth',shorten >=1pt,semithick,font=\sffamily\footnotesize},
  every node/.style={align=center}]

  % Position  nodes using a matrix layout
  \matrix{
      {}
      \& \node[source] (auth) {get authToken};
      \& \\

      {}
      \& \node[process] (database) {read\\database};
      \& \\

      \node[process] (wscall1) {call web\\svc 1};
      \&
      \& \node[process] (wscall2) {call web\\svc 2}; \\

      \node[process] (filter) {filter};
      \&
      \& \node[invisible] (placeholder) {}; \\

      {}
      \& \node[process] (combine) {combine};
      \& \\

      {}
      \& \node[sink] (result) {result};
      \& \\
  };

  % Draw the arrows between the nodes and label them.
  \draw[to] (auth) -- node[midway,right] {auth\\token} (database);
  \draw[to] (database) -- node[midway,left] {PO} (wscall1);
  \draw[to] (database) -- node[midway,right] {PO} (wscall2);
  \draw[to] (wscall1)  -- node[midway,left] {item} (filter);
  \draw[to] (filter)   -- node[midway,left] {item} (combine);
  \draw[to] (wscall2)  -- node[midway,right] {price} (combine);
  \draw[to] (combine)  -- (result);

\end{tikzpicture}
\end{center}
\caption{\label{fig:dataflow}Serially dependent computations}
\end{figure}

\subsection{Fluent Solution in Java, No Error Handling}
\label{sec-2-1}

In the \mbox{C++ -- like} languages, including JavaScript and Java,
we might keep intermediate results in instance variables and model
the flow in object-to-object methods, that is, as
\textbf{transforms}. This style is called \textbf{fluent style}
because the text of the program resembles the flow in the diagram.

Imagine a \emph{main} program like the following, in which each transform
is on its own line, indented from its \emph{source} by one
\mbox{4-space} tab stop. The \textbf{source} of a transform is an
expression that produces an object to feed downstream.
\begin{verbatim}
public static void main(String[] args) {
    Computation databaseResults = new Computation()
        .authorize()
        .readDatabase();
    String result = databaseResults
        .callWebService()
        .filterResults()
        .combineResults(databaseResults
            .callOtherWebService());
    System.out.println(result); }
\end{verbatim}

The correspondence between the diagram of the program and the code
is obvious. The code \emph{looks like} the diagram. Given a change to the
diagrammatic specification, a programmer may propagate the change
straightforwardly to the code due to fluent style.

We save the \emph{Computation} produced by reading the database in its
own local variable, namely \emph{databaseResults}. The dataflow branches
from that result; wd need it twice, once for calling the first web
service and once for calling the second web service. If not for this
branching and recombining of the dataflow, we might have written the
entire program as one, fluent expression with no intermediate
variables.

Also note the non-idiomatic compressed style, minimizing blank lines
and lines with just one closing brace. We adopt this style to save
space in this paper; production versions of such code would have
more white space.

\subsubsection{A Complete Sample Program}
\label{sec-2-1-1}

The following is a complete program that mocks out the database and
web-service results as static JSON objects encoded in strings. This
can be compiled and executed, even online in a sandbox like
\url{http://www.compileonline.com/compile_java_online.php}.

The most important thing to note about this code is that each
method, \emph{e.g.}, \emph{authorize}, \emph{readDatabase}, etc., takes an object
-- implicitly as \emph{this} -- and returns an object. This convention
enables the fluent style by chaining transforms with dot. It so
happens that we return \emph{this} from each method. We could create a
new object in each transform, but it would not simplify the code and
would not give any performance advantage (quite the opposite).
Instead, we propagate values through instance variables, namely
\emph{authToken}, \emph{databaseResults}, etc.
\begin{verbatim}
public class Computation {
    private String authToken;
    private String databaseResults;
    private String webServiceCallResults;
    private String filteredWebServiceCallResults;
    private String otherWebServiceCallResults;

    public Computation () {}
    public Computation authorize() {
        authToken = "John's credentials";
        return this; }
    public Computation readDatabase() {
        databaseResults = "{\"name\":\"John\", \"PO\":\"421357\"}";
        return this; }
    public Computation callWebService() {
        webServiceCallResults =
            "[{\"item\":\"camera\"}, {\"item\":\"shoes\"}]";
        return this; }
    public Computation filterResults() {
        filteredWebServiceCallResults =
            "[{\"item\":\"camera\"}]";
        return this; }
    public Computation callOtherWebService() {
        otherWebServiceCallResults = "{\"price\":\"420.00\"}";
        return this; }
    public String combineResults(Computation other) {
        return "{[" + filteredWebServiceCallResults +
            "," + otherWebServiceCallResults + "]}"; }

    public static void main(String[] args) {
        Computation databaseResults = new Computation()
            .authorize()
            .readDatabase();
        String result = databaseResults
            .callWebService()
            .filterResults()
            .combineResults(databaseResults
                .callOtherWebService());
        System.out.println(result);
}   }
\end{verbatim}
