monads/if-not-error/ex1.org
* Let's Do Better

  Looking back, the main benefits of fluent style are
  + direct correspondence between the program specification and the
    program text -- the text /looks like/ the diagram
  + edits to the specification and edits to the code are
    straightforward and parallel
  + minimal number of temporary variables

  But we only have fluent style if we use exceptions. Without
  exceptions, we're essentially writing assembly language: storing and
  combining intermediate results in temporary variables and checking
  for errors after every step.

  It's possible to do much better, with
  and without exceptions, by going /functional/.

  In Java, the fundamental modeling tool is the /mutable/, /stateful
  object/. Stateful-object programming has many disadvantages:
  + dataflow is awkward to model
  + concurrency requires locks, which are complex; and /global
    reasoning/, which is very complex, to avoid deadlock, livelock,
    cycles, starvation, priority inversion, etc.
  + concurrency with exceptions is very difficult
  + composing stateful objects, even without concurrency, is
    difficult: the operational semantics of even a sequential program
    requires /temporal reasoning/, well outside the capabilities of
    compilers and programming tools

  To begin a trek away from stateful-object programming, start with a
  question. Why did we use a new instance variable in the object,
  /e.g./, /authToken/, /databaseResults/, /webServiceCallResults/,
  etc., for each intermediate state? Why not reuse a single variable
  for all non-error results? After all, we used a single variable for
  the error result?

  The reason is that we wanted the individual methods that update
  non-error state to be as independent as possible. Though our mocks
  don't do so, in a real program, each intermediate computation would
  use the result of its predecessors: /readDatabase/ would use the
  /authToken/, the web-service calls would use /databaseResults/ and
  so on. With a separate, named variable for each intermediate result,
  the correctness of individual sub-computations would be easier to
  verify by inspection. With a single, re-used /String/ variable,
  temporal flow would be even more obscured and the program would be
  even more difficult to understand and maintain. It is definitely
  worth a few more named variables to make the program easier for the
  next programmer tasked with reading the code. Because the only tool
  in Java is mutable state, it is hard to do better than a sequence of
  instance variables mirroring the sequence of sub-computations.

  The essence of the problem is in modeling a /flow/ of data through
  /transforms/ as a flow of data through mutable variables. If,
  instead, we invert the paradigm to put the /transforms/ under focus,
  we sidestep this problem. Doing so requires a language with
  first-class transforms, that is, /functions/. Mutable state
  variables become immutable function parameters. Thread-safety
  becomes automatic and locks do not arise.

  \mbox{C\#} has first-class functions, a.k.a. /lambda expressions/,
  as does \mbox{C++ 11} and as will \mbox{Java 8}. In the mean time,
  we can use /Clojure/, a Java-compatible functional language.

  As to error handling, fluency is immediate with exceptions, as
  before. We achieve fluency for errors-as-return-values with a
  /monad/. Despite the name, monads are not exotic or complicated.
  They furnish a straight generalization of function composition. Our
  monad flows values through the pipeline, applying user-supplied
  functions only when an error has not been produced. The
  user-supplied functions do not need to check. This monad abstracts
  the boilerplate code for checking errors.

  Other monads abstract other boilerplate into the monad machinery,
  leaving user-supplied code free of clutter. Monads are inherently
  stateless, so are not a good fit in stateful-object programming
  languages. They are fundamental for concurrent and distributed
  programming, and their benefits are evident in functional
  programming languages.

