monads/if-not-error/ex1.org
** Fluent Functional Solution With Exceptions

  We may write the program with only one intermediate variable, as
  before. This variable holds results of the database read, which we
  must use for each of the two web-service calls. There are many
  techniques for eliminating this variable, such as /memoization/,
  /common sub-expression elimination/, /lambda lifting/, /the state
  monad/, or /parallel composition/. That is for another time and
  place. For now, write the flow directly as a sequential composition
  of function calls /via/ Clojure's \verb|->|, using its \verb|let|
  syntax for the one intermediate variable, as follows:

#+NAME: functional-main-1
#+BEGIN_SRC clojure :tangle no
(try
  (let [db-results ; be the result of the composition
        (-> (computation)
            authorize
            read-database
            )]
    (-> db-results 
        call-web-service
        filter-ws
        (combine (-> db-results
                     call-other-web-service))))
  (catch Exception e (.getMessage e)))
#+END_SRC

  This looks very much like the fluent Java solution. In Java, we have
  fluent streams of items connected by dots. In Clojure, we have the
  same fluent streams of items headed by arrows. The fundamental
  difference is that Clojure has no instance variables, therefore it
  is automatically re-entrant, unlike our Java solution. The semantics
  of the Clojure program is evident in the text -- it's a flow of data
  through serially dependent computations. There is no temporal
  component to the semantics. Contrast with the Java solution, where
  we must understand the temporal sequence of operations to
  understand the program.

  The rest of the Clojure program is as follows. First, declare a
  namespace for our symbols to inhabit:

#+NAME: functional-helpers-1
#+BEGIN_SRC clojure :tangle no
(ns temp-1.core)
#+END_SRC

  Define a private symbol, /computation/, to be a function of no
  arguments (denoted by the empty square braces) that produces an
  empty hash-map (denoted by the empty curly braces).

#+NAME: functional-helpers-2
#+BEGIN_SRC clojure :tangle no
(defn- computation [] {})
#+END_SRC

  Define a private symbol /randomly-error/ to be a function of no
  arguments that produces /true/ if a random double-precision number
  is less than $0.10$. 
  
#+NAME: functional-helpers-3
#+BEGIN_SRC clojure :tangle no
(defn- randomly-error [] (< (rand) 0.10))
#+END_SRC

  Define several private symbols to be mocks of functions that produce
  application-specific data, or, with $10\%$ probability, throw an
  exception. These all use three-term /if/-branch forms, equivalent to Java's
  $\langle{}e_1\rangle{}\texttt{?}\langle{}e_2\rangle{}\texttt{:}\langle{}e_3\rangle{}$
  operator, taking an expression of Boolean type and two arbitrary
  expressions, only one of which is evaluated.
  
#+NAME: functional-helpers-4
#+BEGIN_SRC clojure :tangle no
(defn- authorize [computation]
  (if (randomly-error) (throw (Exception. "auth errored"))
                       {:auth-token "John's credentials"}))
(defn- read-database [auth-token]
  (if (randomly-error) (throw (Exception. "database errored"))
                       {:name "John", :PO 421357}))
(defn- call-web-service [database-results]
  (if (randomly-error) (throw (Exception. "ws1 errored"))
                       [{:item "camera"}, {:item "shoes"}]))
(defn- filter-ws [web-service-call-results]
  (if (randomly-error) (throw (Exception. "filter errored"))
                       [{:item "camera"}]))
(defn- call-other-web-service [database-results]
  (if (randomly-error) (throw (Exception. "ws2 errored"))
                       [{:price 420.00M}]))
#+END_SRC

  The last application-specific function, /combine/ takes two
  arguments and combines them.

#+NAME: functional-helpers-5
#+BEGIN_SRC clojure :tangle no
(defn- combine [filtered-web-service-results
                other-web-service-call-results]
  (if (randomly-error)
      (throw (Exception. "combine errored"))
      (concat filtered-web-service-results
              other-web-service-call-results)))
#+END_SRC

  Several improvements are notable in this attempt:
  + first, as stated, with only one exception, state variables have
    become immutable parameters to re-entrant functions, purely local
    to each transform
  + the one remaining intermediate variable is itself immutable,
    removing any need for temporal reasoning -- we only need to
    understand dependencies, and they are explicit in the code
  + the code is shorter, less repetitive, less noisy
  + the values of each mock can be modeled directly as hash-maps,
    arrays, integers, and decimal numbers like $420.00M$, as opposed
    to JSON objects encoded in strings
    + such direct modeling removes the implied need, unstated in our
      Java solution, for JSON-processing code
    + such direct modeling also means that we do not need direct Java
      interop; our /computation/ ``constructor'' just returns an empty
      hash-map 
    + if we did need need an exising Java class, we would only need to
      /import/ the class and change our constructor call from
      \verb|(computation)| to \verb|(Computation.)|, shorthand for \\
      \verb|(new Computation)|
    
  We continue to use Java's native /Exception/ class.

** Fluent Error Handling Without Exceptions

   The improvements above alone justify the Clojure solution over the
   Java solution. But the case is really obvious when we get to error
   handling without exceptions. In Clojure, we use a variation of
   \textbf{the Maybe monad}.[fn::http://bit.ly/WV02FF]

   Here is the main code:
#+NAME: monadic-main
#+BEGIN_SRC clojure :tangle no
(let [db-results
      (=>> (computation)
           authorize
           read-database)]
  (=>> db-results
       call-web-service
       filter-ws
       (combine (=>> db-results
                     call-other-web-service))))
#+END_SRC
   
   It looks /just like/ the non-monadic code, only with a different
   arrow. The prerequisite helpers are as follows:
   
#+NAME: monadic-helpers-1
#+BEGIN_SRC clojure :tangle no
(defn- computation [] (with-em-result {}))
(defn- authorize [computation]
  (with-em-result
    (if (randomly-error) {:error "auth errored"}
                         {:auth-token "John's credentials"})))
(defn- read-database [auth-token]
  (with-em-result
    (if (randomly-error) {:error "database errored"}
                         {:name "John", :PO 421357})))
(defn- call-web-service [database-results]
  (with-em-result
    (if (randomly-error) {:error "ws1 errored"}
                         [{:item "camera"}, {:item "shoes"}])))
(defn- filter-ws [web-service-call-results]
  (with-em-result
    (if (randomly-error) {:error "filter errored"}
                         [{:item "camera"}])))
(defn- call-other-web-service [database-results]
  (with-em-result
    (if (randomly-error) {:error "ws2 errored"}
                         [{:price 420.00M}])))
#+END_SRC

   All but /combine/ are straightforward modifications of the
   non-monadic code, simply wrapping their results in a
   /with-em-result/. In fact, this wrapping is one of only two things
   we must learn about monads: \textbf{it puts values in boxes}.

