monads/if-not-error/ex1.tex

\subsection{Fluent Functional Solution With Exceptions}
\label{sec-3-1}

We may write the program with only one intermediate variable, as
before. This variable holds results of the database read, which we
must use for each of the two web-service calls. There are many
techniques for eliminating this variable, such as \emph{memoization},
\emph{common sub-expression elimination}, \emph{lambda lifting}, \emph{the state
monad}, or \emph{parallel composition}. That is for another time and
place. For now, write the flow directly as a sequential composition
of function calls \emph{via} Clojure's \verb|->|, using its \verb|let|
syntax for the one intermediate variable, as follows:

\begin{figure}[H]
\label{functional-main-1}
\begin{verbatim}
(try
  (let [db-results ; be the result of the composition
        (-> (computation)
            authorize
            read-database
            )]
    (-> db-results
        call-web-service
        filter-ws
        (combine (-> db-results
                     call-other-web-service))))
  (catch Exception e (.getMessage e)))
\end{verbatim}
\end{figure}

This looks very much like the fluent Java solution. In Java, we have
fluent streams of items connected by dots. In Clojure, we have the
same fluent streams of items headed by arrows. The fundamental
difference is that Clojure has no instance variables, therefore it
is automatically re-entrant, unlike our Java solution. The semantics
of the Clojure program is evident in the text -- it's a flow of data
through serially dependent computations. There is no temporal
component to the semantics. Contrast with the Java solution, where
we must understand the temporal sequence of operations to
understand the program.

The rest of the Clojure program is as follows. First, declare a
namespace for our symbols to inhabit:

\begin{figure}[H]
\label{functional-helpers-1}
\begin{verbatim}
(ns temp-1.core)
\end{verbatim}
\end{figure}

Define a private symbol, \emph{computation}, to be a function of no
arguments (denoted by the empty square braces) that produces an
empty hash-map (denoted by the empty curly braces).

\begin{figure}[H]
\label{functional-helpers-2}
\begin{verbatim}
(defn- computation [] {})
\end{verbatim}
\end{figure}

Define a private symbol \emph{randomly-error} to be a function of no
arguments that produces \emph{true} if a random double-precision number
is less than $0.10$.

\begin{figure}[H]
\label{functional-helpers-3}
\begin{verbatim}
(defn- randomly-error [] (< (rand) 0.10))
\end{verbatim}
\end{figure}

Define several private symbols to be mocks of functions that produce
application-specific data, or, with $10\%$ probability, throw an
exception. These all use three-term \emph{if}-branch forms, equivalent to Java's
$\langle{}e_1\rangle{}\texttt{?}\langle{}e_2\rangle{}\texttt{:}\langle{}e_3\rangle{}$
operator, taking an expression of Boolean type and two arbitrary
expressions, only one of which is evaluated.

\begin{figure}[H]
\label{functional-helpers-4}
\begin{verbatim}
(defn- authorize [computation]
  (if (randomly-error) (throw (Exception. "auth errored"))
                       {:auth-token "John's credentials"}))
(defn- read-database [auth-token]
  (if (randomly-error) (throw (Exception. "database errored"))
                       {:name "John", :PO 421357}))
(defn- call-web-service [database-results]
  (if (randomly-error) (throw (Exception. "ws1 errored"))
                       [{:item "camera"}, {:item "shoes"}]))
(defn- filter-ws [web-service-call-results]
  (if (randomly-error) (throw (Exception. "filter errored"))
                       [{:item "camera"}]))
(defn- call-other-web-service [database-results]
  (if (randomly-error) (throw (Exception. "ws2 errored"))
                       [{:price 420.00M}]))
\end{verbatim}
\end{figure}

The last application-specific function, \emph{combine} takes two
arguments and combines them.

\begin{figure}[H]
\label{functional-helpers-5}
\begin{verbatim}
(defn- combine [filtered-web-service-results
                other-web-service-call-results]
  (if (randomly-error)
      (throw (Exception. "combine errored"))
      (concat filtered-web-service-results
              other-web-service-call-results)))
\end{verbatim}
\end{figure}

Several improvements are notable in this attempt:
\begin{itemize}
\item first, as stated, with only one exception, state variables have
become immutable parameters to re-entrant functions, purely local
to each transform
\item the one remaining intermediate variable is itself immutable,
removing any need for temporal reasoning -- we only need to
understand dependencies, and they are explicit in the code
\item the code is shorter, less repetitive, less noisy
\item the values of each mock can be modeled directly as hash-maps,
arrays, integers, and decimal numbers like $420.00M$, as opposed
to JSON objects encoded in strings
\begin{itemize}
\item such direct modeling removes the implied need, unstated in our
Java solution, for JSON-processing code
\item such direct modeling also means that we do not need direct Java
interop; our \emph{computation} ``constructor'' just returns an empty
hash-map
\item if we did need need an exising Java class, we would only need to
      \emph{import} the class and change our constructor call from
      \verb|(computation)| to \verb|(Computation.)|, shorthand for \\
      \verb|(new Computation)|
\end{itemize}
\end{itemize}

We continue to use Java's native \emph{Exception} class.
\subsection{Fluent Error Handling Without Exceptions}
\label{sec-3-2}

The improvements above alone justify the Clojure solution over the
Java solution. But the case is really obvious when we get to error
handling without exceptions. In Clojure, we use a variation of
\textbf{the Maybe monad}.\footnote{\url{http://bit.ly/WV02FF}}

Here is the main code:
\begin{figure}[H]
\label{monadic-main}
\begin{verbatim}
(let [db-results
      (=>> (computation)
           authorize
           read-database)]
  (=>> db-results
       call-web-service
       filter-ws
       (combine (=>> db-results
                     call-other-web-service))))
\end{verbatim}
\end{figure}

It looks \emph{just like} the non-monadic code, only with a different
arrow. The prerequisite helpers are as follows:

\begin{figure}[H]
\label{monadic-helpers-1}
\begin{verbatim}
(defn- computation [] (with-em-result {}))
(defn- authorize [computation]
  (with-em-result
    (if (randomly-error) {:error "auth errored"}
                         {:auth-token "John's credentials"})))
(defn- read-database [auth-token]
  (with-em-result
    (if (randomly-error) {:error "database errored"}
                         {:name "John", :PO 421357})))
(defn- call-web-service [database-results]
  (with-em-result
    (if (randomly-error) {:error "ws1 errored"}
                         [{:item "camera"}, {:item "shoes"}])))
(defn- filter-ws [web-service-call-results]
  (with-em-result
    (if (randomly-error) {:error "filter errored"}
                         [{:item "camera"}])))
(defn- call-other-web-service [database-results]
  (with-em-result
    (if (randomly-error) {:error "ws2 errored"}
                         [{:price 420.00M}])))
\end{verbatim}
\end{figure}

All but \emph{combine} are straightforward modifications of the
non-monadic code, simply wrapping their results in a
\emph{with-em-result}. In fact, this wrapping is one of only two things
we must learn about monads: \textbf{it puts values in boxes}.
