monads/if-not-error/ex1.org
*** Monads Are Values In Boxes

   An instance of a monad is just a value in a box. Every monad has an
   operator, /m-result/, which takes a value and puts it in a
   box. All monads work this way: take a value and put it in a box.
   The box can be arbitrarily complicated inside, and each type of
   monad has its own type of box. But all monads have the /m-result/
   operator in common.

   The /with-em-result/ macro used above is just shorthand /m-result/ for
   our error-propagating monad. Here is its definition:
#+NAME: with-em-result-macro
#+BEGIN_SRC clojure :tangle no
(defmacro with-em-result [expr]
  `(with-monad if-not-error-m (m-result ~expr)))
#+END_SRC

   Monads have one more essential operator, /m-bind/. This takes two
   arguments: a value-in-a-box and a
   function-that-puts-a-value-in-a-box. This function's signature is
   just like the signature of /m-result/: it takes a value and puts it
   in a box. Here we see again the fundamental simplifying idea: put
   values in boxes.
   
   Our monad is called /if-not-error-m/. Its /m-result/ operator
   simply returns its input. This monad's box is an invisible box.
   That's ok; monadic boxes can be arbitrarily complicated, including
   not complicated at all. A real-world implementation might do
   logging as a side-effect. Our monad's /m-bind/ takes a
   value-in-a-box and a user-supplied function, like the /m-binds/ of
   all monads. With this monad, /m-bind/ applies the user-supplied
   function only if the value doesn't have an error in it. Otherwise,
   it puts the value, including its error, in a box and passes it down
   the line. Since every subsequent element of the pipeline must go
   through the very same /m-bind/, the very first error produced in
   the pipeline is propagated all the way through. All subsequent
   user-supplied functions are sidestepped. If there is no error, it
   applies the user-supplied function to the value. The user-supplied
   function has the responsibility of putting the value in a box,
   automated by our /with-em-result/ macro.
#+BEGIN_SRC clojure :tangle no
(defmonad if-not-error-m
  [m-result (fn [value] value)
   m-bind   (fn [value f]
              (if-not (:error value)
                (f value) 
                (m-result value)))
  ])
#+END_SRC

   We can see how our new arrow operator, \verb|=>>|, composes values
   through /m-bind/. For instance, the fragment

#+BEGIN_SRC clojure :tangle no
(=>> (computation)
      authorize
      read-database)
#+END_SRC
   expands approximately to
#+BEGIN_SRC clojure :tangle no
(with-monad if-not-error-m
  (m-bind
    (m-bind (computation)
            (fn [temp] (authorize temp)))
    (fn [temp] (read-database temp))))
#+END_SRC
   Longer chains expand to more deeply nested compositions of /m-bind/
   behind the scenes, precisely where it should be. Contrast this to
   the Java situation, where we had no tools in the language for
   mitigating intolerable nesting and proliferation of temporaries.
   Here, we define our arrow directly in our application code.
   Clojure, in particular, and homoiconic
   languages,[fn::http://en.wikipedia.org/wiki/Homoiconicity] in
   general, often have embedded rewrite
   systems[fn::http://en.wikipedia.org/wiki/Rewriting] or macro
   languages.[fn::http://en.wikipedia.org/wiki/Macro_(computer_science)]
   Without going more deeply into Clojure's macro syntax or the
   monadic /m-chain/ helper it employs, the arrow macro is at least
   small:
#+BEGIN_SRC clojure :tangle no
(defmacro =>> [in-monad & transforms]
  `(with-monad if-not-error-m
     ((m-chain [~@transforms]) ~in-monad)))
#+END_SRC
   
   The final monadic helper, /combine/, illustrates /m-bind/ directly.
   Given a value from the second of the two web-service calls, it
   produces a /closure/
   [fn::http://en.wikipedia.org/wiki/Closure_(computer_science)]
   a first-class value of type
   /function-that-puts-a-value-in-a-box/. That function
   will be composed, /via/ /m-bind/, with the filtered value of the first
   of the two web-service calls. We use the suffix /-val/ to
   distinguish values-not-in-boxes from value-in-boxes, which are
   produce by /with-em-result/.
#+NAME: monadic-helpers-2
#+BEGIN_SRC clojure :tangle no
(defn- combine [other-ws-results-val]
  (fn [filtered-ws-results-val]
    (with-em-result ; produces a value-in-a-box
      (if (randomly-error)
        {:error "combine errored"}
        (concat filtered-ws-results-val
                other-ws-results-val)))))
#+END_SRC

*** Monad Particulars and Generalities

   The implementations of /m-result/ and /m-bind/ are particular to
   each monad. Package your application-dependent logic in
   user-supplied functions-that-put-values-in-a-box. Compose them /via/
   /m-bind/, /m-chain/, or the \verb|=>>| operator.

*** Varying from the Standard Maybe Monad

   Why do we have a variation of the standard /Maybe/ monad? Why not
   just use /Maybe/? First, /Maybe/ produces an unadorned /Nothing/ if
   anything goes wrong. The consumer of the computation doesn't know
   what stage of the pipeline failed nor any details at all about the
   error. Such is not tolerable in the real world. In our example of a
   database read followed by web-service calls followed by filtering
   and combining, if something goes wrong in this sequence of
   computations, we need to know exactly where and to log as much
   detail as we can get about the failure. But we certainly don't want
   any computations downstream of the failure to be attempted. We
   want the pass-through semantics of /Maybe/ but without the ignorance.

* Conclusion

  Controlling complexity is the central problem of software
  engineering. Making code closer to specifications is essential, and
  that is the central theme of progress in programming languages. 
  
  Many business processes are fundamentally data-flows. Modeling
  data-flows directly in our programming languages and applications is
  a clear advantage.

  Fluent style is a direct representation of dataflow dependencies in
  the text of a program. Stateful-object programming is an awkward fit
  to fluent style. The semantics of stateful-object programs are
  temporal and implicit, while the semantics of fluent style are
  dependency-based and explicit.

  Fluent style can be approached in stateful-object programming by
  simulating flow-through-transforms as
  flow-through-instance-variables, but the style is brittle. For
  instance, changing from errors-as-exceptions to
  errors-as-return-codes makes fluent style intractable.

  Furthermore, tateful-object programming makes concurrency more
  hazardous. Composability of objects and exceptions is difficult to
  test, and manual, pattern-based concurrent programming with locks is
  a dark art for the elite few. Yet, concurrency is necessary in
  everyday web programming.

  In addition to enabling fluent style everywhere, functional
  programming aleviates the other hazards of stateful-object
  programming. It is composable both with exceptions and with
  errors-as-return-codes. Because function-parameters are immutable,
  functions are naturally re-entrant. Functional programming also
  sidesteps the temporal reasoning required for stateful-object
  programming, making code easier to test and debug.

  
